{
  "start": {
    "text": "STARDATE 2247.3 - U.S.S. Discovery\n\nYou are Commander Sarah Chen, captain of the deep space exploration vessel Discovery. Your ship has detected anomalous readings from a previously unexplored sector of space.\n\nAs you approach the mysterious signal, your sensors detect something impossible - a massive structure that shouldn't exist according to current physics models.\n\nWhat do you do?",
    "choices": ["Investigate the structure", "Scan from a safe distance", "Contact Star Command for orders"],
    "outcomes": ["investigate", "scan", "contact"]
  },
  "investigate": {
    "text": "You order the Discovery to approach the signal source. As you draw closer, your sensors detect a massive alien structure that defies known physics.\n\nSuddenly, your ship is caught in an energy field. A voice echoes through your comm system:\n\n'Welcome, Commander Chen. We are the Architects. You have been chosen to participate in the Great Test.'",
    "choices": ["Respond to the voice", "Try to break free", "Analyze the communication"],
    "outcomes": ["respond", "break_free", "analyze"]
  },
  "scan": {
    "text": "You maintain a safe distance and begin detailed scans. Your science officer reports:\n\n'Commander, this structure is generating its own gravitational field and manipulating local space-time. It's unlike anything in our database.'\n\nYour long-range sensors detect multiple other similar structures throughout the sector.",
    "choices": ["Continue scanning", "Move to another structure", "Return to Star Command"],
    "outcomes": ["continue_scan", "move_another", "return_command"]
  },
  "contact": {
    "text": "You open a subspace channel to Star Command. After a brief delay, Admiral Thompson responds:\n\n'Commander Chen, this is highly unusual. We're seeing your telemetry data here. That structure... our records show nothing like it. Proceed with extreme caution. We're sending reinforcements, but they won't arrive for three days.'\n\nAs the transmission ends, you notice something disturbing - the structure appears to have moved closer to your ship.",
    "choices": ["Wait for reinforcements", "Investigate immediately", "Evacuate the sector"],
    "outcomes": ["wait_reinforcements", "investigate_now", "evacuate"]
  },
  "respond": {
    "text": "You activate your comm system and respond: 'This is Commander Sarah Chen of the U.S.S. Discovery. Who are you?'\n\nThe voice replies with what sounds like amusement: 'We are the Architects. We have been waiting for your species to reach this level of development. You have been chosen to participate in the Great Test.'\n\nYour science officer whispers urgently: 'Commander, I'm detecting massive energy readings from the structure. It's powering up something...'",
    "choices": ["Ask about the Great Test", "Demand answers", "Prepare for battle"],
    "outcomes": ["ask_test", "demand_answers", "prepare_battle"]
  },
  "ask_test": {
    "text": "'What is this Great Test you speak of?' you ask.\n\nThe voice responds: 'The Great Test determines whether a species is ready to join the Galactic Community. It tests your wisdom, courage, and ability to work together. Many species have failed this test.'\n\n'What happens to those who fail?' you ask.\n\n'They are... contained. Until they are ready to try again. But you, Commander Chen, show promise. You may yet succeed where others have failed.'",
    "choices": ["Accept the test", "Refuse to participate", "Ask for more information"],
    "outcomes": ["accept_test", "refuse_test", "more_info"]
  },
  "accept_test": {
    "text": "You take a deep breath and respond: 'We accept your test. Humanity is ready to prove ourselves.'\n\nThe structure begins to glow brighter, and you feel a strange sensation - as if you're being transported somewhere else. When the light fades, you find yourself in what appears to be a vast, alien laboratory.\n\nA holographic figure appears before you - a being that looks vaguely humanoid but clearly alien. 'Welcome to the Test Chamber, Commander Chen. Your first challenge awaits. You must choose: save your crew, or save a planet full of strangers. You have one hour to decide.'",
    "choices": ["Save your crew", "Save the alien planet", "Try to save both"],
    "outcomes": ["save_crew", "save_planet", "save_both"]
  },
  "save_both": {
    "text": "You refuse to accept the false choice. 'I won't choose between innocent lives!' you declare. 'There must be another way!'\n\nYou begin analyzing the test chamber, looking for weaknesses in the system. Your engineering background kicks in as you notice patterns in the energy flows.\n\n'Commander!' your science officer calls out. 'I think I can reroute the power systems to create a feedback loop that will neutralize both threats!'\n\nWorking together, you and your crew manage to save both your ship and the alien planet. The holographic figure appears again, but this time it's smiling.\n\n'Excellent, Commander Chen. You have shown wisdom beyond your years. You have passed the first test. Welcome to the Galactic Community.'",
    "choices": ["Accept the invitation", "Ask about responsibilities", "Request to return home"],
    "outcomes": ["accept_invitation", "ask_responsibilities", "return_home"]
  },
  "accept_invitation": {
    "text": "You accept the invitation with honor and humility. 'Thank you. I accept this responsibility on behalf of humanity.'\n\nThe alien proctor smiles. 'Excellent. You will serve as humanity's ambassador to the Galactic Community. Your species has much to learn, but also much to teach.'\n\nYou are returned to your ship, but now it's equipped with advanced technology and communication systems that will allow you to maintain contact with your new allies.\n\nAs you set course for Earth, you reflect on the incredible journey you've just completed. Humanity is no longer alone in the universe - and you have been chosen to guide them into this new era.\n\nYour adventure has only just begun...\n\n[END OF CHAPTER ONE]",
    "choices": ["Restart the adventure", "Exit the game"],
    "outcomes": ["restart", "exit_game"]
  },
  "restart": {
    "text": "You decide to experience the adventure again, perhaps making different choices this time...\n\nThe story begins anew...",
    "choices": ["Start over"],
    "outcomes": ["start"]
  }
}